_Rarzrabotki/Rarus/USO2/AccumulationRegisters/АУН_НачисленияПоТарифицируемымУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>АУН_НачисленияПоТарифицируемымУслугам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/АУН_Ставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АУН_Ставки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_СпособыНачисленияАренднойПлаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/АУН_СтатусыОбъектовАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АУН_СтатусыОбъектовАренды</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_СтатусыОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АУН_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/АУН_СтатусыОбъектовАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>АУН_СтатусыОбъектовАренды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВАренде</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьОбособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗаказов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Требуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_СпособыНачисленияАренднойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_СпособыНачисленияАренднойПлаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_ВариантыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/АУН_ПроцедурыНачисления/Ext/Module.bsl
#Область ОбработкаКлиентскихВызовов

// Процедура обрабатывает команду, переданную из клиентского модуля
Процедура ОбработатьКомандуРассчитатьНачислениеАренды(ДанныеФормы, ДополнительныеПараметры) Экспорт
	
	ИмяДокумента = ДанныеФормы.Ссылка.Метаданные().Имя;
	ДокументОбъект = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект." + ИмяДокумента));
	
	Если ДополнительныеПараметры.ЭтоПостояннаяЧасть Тогда
		РассчитатьПостояннуюЧастьОплаты(ДокументОбъект);
	Иначе
		РассчитатьПеременнуюЧастьОплаты(ДокументОбъект);
	КонецЕсли;
	УстановитьПризнакВключенияНДСВСтоимость(ДокументОбъект, "Товары", Истина);
	
	ЗначениеВДанныеФормы(ДокументОбъект, ДанныеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСНачислениемАренды

// Процедура предназначена для автоматического заполнения заказа клиента и реализации
// в случае заполнения не по счетам услугами
// постоянной части оплаты
// Параметры:
//		Объект - документ-объект.
Процедура РассчитатьПостояннуюЧастьОплаты(ДокументОбъект) Экспорт
	
	ДанныеОбъекта = АУН_ОбщиеПроцедуры.ПрочитатьДанныеОбъекта(ДокументОбъект, Истина);
	КоллекцияРеквизитов = АУН_ОбщиеПроцедурыКлиентСервер.ПолучитьКоллекциюРеквизитов(ДокументОбъект);
	
	ДанныеУчета = ПолучитьДанныеПостояннойЧастиОплаты(ДанныеОбъекта);
	
	Для Каждого Колонка Из ДанныеУчета.Колонки Цикл
		Если КоллекцияРеквизитов.Свойство(Колонка.Имя) Тогда
			Колонка.Имя = КоллекцияРеквизитов[Колонка.Имя];
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ДанныеУчета Цикл
		Если НЕ СтрокаДанных.Цена = 0 Тогда
			СтрокаТовары = ДокументОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеПостояннойЧастиОплаты(ДанныеОбъекта) Экспорт
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ДанныеУчета.Колонки.Добавить("Номенклатура");
	ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	ДанныеУчета.Колонки.Добавить("ПериодАренды");
	ДанныеУчета.Колонки.Добавить("СпособНачисления");
	ДанныеУчета.Колонки.Добавить("СтавкаСпособаНачисления");
	ДанныеУчета.Колонки.Добавить("КоличествоДней");
	ДанныеУчета.Колонки.Добавить("ПериодНачало");
	ДанныеУчета.Колонки.Добавить("ПериодКонец");
	ДанныеУчета.Колонки.Добавить("ДатаНачалаАренды");
	ДанныеУчета.Колонки.Добавить("ДатаОкончанияАренды");
	ДанныеУчета.Колонки.Добавить("Цена");
	ДанныеУчета.Колонки.Добавить("Количество");
	ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	ДанныеУчета.Колонки.Добавить("Сумма");
	ДанныеУчета.Колонки.Добавить("Валюта");
	ДанныеУчета.Колонки.Добавить("Курс");
	ДанныеУчета.Колонки.Добавить("Кратность");
	ДанныеУчета.Колонки.Добавить("ВариантОбеспечения");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", ДанныеОбъекта.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ДанныеОбъекта.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", ДанныеОбъекта.Договор);
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(ДанныеОбъекта.Дата));
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АУН_СтатусыОбъектовАренды.ВАренде);
	
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти();
				
	ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		// Обход по услугам
		ВыборкаОбъектов = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			// Обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				// Обход по периодам изменения параметров начисления арендной платы
				
				Если ВыборкаДанных.ПериодКонец <= ВыборкаДанных.ДатаНачалаАренды Тогда // Объект сдан не с начала периода
					КоличествоПериодов = КоличествоПериодов - 1;
					Продолжить;
				КонецЕсли;
				
				Если КоличествоОбработанныхПериодов = 0
					И Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда
					ТекстСообщения = "Для объекта аренды """ + ВыборкаДанных.АУН_ОбъектАренды + """ по услуге """ + ВыборкаДанных.Номенклатура 
					+ """ на дату " + Формат(ВыборкаДанных.ПериодНачало, "ДФ=dd.MM.yyyy") + " не задана ставка!";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					ДанныеУчета[ДанныеУчета.Количество()-1].ПериодКонец = НачалоДня(ВыборкаДанных.ПериодНачало-1);	
				КонецЕсли;
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
				Если Не ЗначениеЗаполнено(ВыборкаДанных.СтавкаНДС) Тогда
					Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				КонецЕсли;
				
				Если (ТипЗнч(Стр.Количество) = Тип("NULL")) или (Стр.Количество=0) тогда
					Стр.Количество=1;	
				конецЕсли;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ПериодКонец = Мин(ВыборкаДанных.ДатаОкончанияАренды, ДанныеОбъекта.ОкончаниеПериода);
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Необходимо разбить все периоды по периодам договора или периодам способа начисления.
	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		Периодичность = Перечисления.Периодичность.Месяц;
		СтрокаТаб.ПериодАренды = НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность);
		
		// Если периодичность больше месяца, то разобъем по месяцам
		// кроме случа Периодичность = Год и период начисления - календарный год или несколько.
		Если Периодичность = Перечисления.Периодичность.Год
			И ДанныеОбъекта.НачалоПериода = НачалоГода(ДанныеОбъекта.НачалоПериода)
			И КонецДня(ДанныеОбъекта.ОкончаниеПериода) = КонецГода(ДанныеОбъекта.ОкончаниеПериода) Тогда
		ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
			Периодичность = Перечисления.Периодичность.Месяц;
		КонецЕсли;
		
		Если НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность) < НачалоПериода(СтрокаТаб.ПериодКонец, Периодичность) Тогда
			НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаТаб);
			СтрокаТаб.ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
			НоваяСтрокаТаб.ПериодНачало = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность) + 1;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	РассчитатьСуммуНачисления(ДанныеУчета);
	
	РассчитатьСуммуЦену(ДанныеОбъекта, ДанныеУчета, Истина);
	
	ДанныеУчета.Свернуть("Номенклатура,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,ВариантОбеспечения","Сумма,КоличествоДней");
	
	Возврат ДанныеУчета;
	
КонецФункции

// Процедура предназначена для автоматического заполнения заказа клиента и реализации
// в случае заполнения не по счетам услугами
// переменной части оплаты
// Параметры:
//		Объект - документ-объект
//		ИмяТабличнойЧасти - имя табличной части, которая будет заполнена данными из выборки.
Процедура РассчитатьПеременнуюЧастьОплаты(ДокументОбъект) Экспорт
	
	ДанныеОбъекта = АУН_ОбщиеПроцедуры.ПрочитатьДанныеОбъекта(ДокументОбъект, Истина);
	КоллекцияРеквизитов = АУН_ОбщиеПроцедурыКлиентСервер.ПолучитьКоллекциюРеквизитов(ДокументОбъект);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", ДанныеОбъекта.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ДанныеОбъекта.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", ДанныеОбъекта.Договор);
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(ДанныеОбъекта.Дата));
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АУН_СтатусыОбъектовАренды.ВАренде);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АУН_НачисленияПоТарифицируемымУслугамОбороты.УслугаАренды КАК Номенклатура,
	|	АУН_НачисленияПоТарифицируемымУслугамОбороты.ОбъектАренды КАК ОбъектАренды,
	|	АУН_НачисленияПоТарифицируемымУслугамОбороты.Ставка КАК СтавкаСпособаНачисления,
	|	АУН_НачисленияПоТарифицируемымУслугамОбороты.Ставка КАК Цена,
	|	АУН_НачисленияПоТарифицируемымУслугамОбороты.КоличествоОборот КАК Количество,
	|	АУН_НачисленияПоТарифицируемымУслугамОбороты.СуммаОборот КАК Сумма,
	|	ЕСТЬNULL(АУН_СтавкиСрезПоследних.СтавкаНДС, АУН_НачисленияПоТарифицируемымУслугамОбороты.УслугаАренды.СтавкаНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(АУН_СтавкиСрезПоследних.СпособНачисления, ЗНАЧЕНИЕ(Справочник.АУН_СпособыНачисленияАренднойПлаты.ПустаяСсылка)) КАК СпособНачисления,
	|	ЕСТЬNULL(АУН_СтавкиСрезПоследних.СпособНачисления.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
	|	АУН_НачисленияПоТарифицируемымУслугамОбороты.Договор КАК Договор,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется) КАК ВариантОбеспечения
	|ИЗ
	|	РегистрНакопления.АУН_НачисленияПоТарифицируемымУслугам.Обороты(
	|			,
	|			,
	|			,
	|			Договор = &Договор
	|				И (ПериодАренды МЕЖДУ &НачалоПериода И &КонецПериода)) КАК АУН_НачисленияПоТарифицируемымУслугамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АУН_Ставки.СрезПоследних(&КонецПериода, Договор = &Договор) КАК АУН_СтавкиСрезПоследних
	|		ПО АУН_НачисленияПоТарифицируемымУслугамОбороты.УслугаАренды = АУН_СтавкиСрезПоследних.Услуга
	|			И АУН_НачисленияПоТарифицируемымУслугамОбороты.ОбъектАренды = АУН_СтавкиСрезПоследних.ОбъектАренды";
	
	ДанныеУчета = Запрос.Выполнить().Выгрузить();
	
	ДанныеУчета.Колонки.Добавить("ПериодАренды");

	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаб.Цена) Тогда
			ТекстСообщения = "Для объекта аренды """ + СтрокаТаб.ОбъектАренды + """ по услуге """ + СтрокаТаб.Номенклатура + """ на дату " + Формат(ДанныеОбъекта.ОкончаниеПериода, "ДФ=dd.MM.yyyy") + " не задана ставка!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьСуммуЦену(ДанныеОбъекта, ДанныеУчета);
	
	Для Каждого Колонка Из ДанныеУчета.Колонки Цикл
		Если КоллекцияРеквизитов.Свойство(Колонка.Имя) Тогда
			Колонка.Имя = КоллекцияРеквизитов[Колонка.Имя];
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ДанныеУчета Цикл
		СтрокаТовары = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаДанных);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АУН_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АУН_СтавкиСрезПоследних.Услуга,
	|	АУН_СтавкиСрезПоследних.ОбъектАренды,
	|	АУН_СтавкиСрезПоследних.Ставка,
	|	АУН_СтавкиСрезПоследних.СтавкаНДС,
	|	АУН_СтавкиСрезПоследних.СпособНачисления,
	|	АУН_СтавкиСрезПоследних.Площадь
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АУН_Ставки.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоПериода, ДЕНЬ), Договор = &Договор) КАК АУН_СтавкиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АУН_Ставки.Период, ДЕНЬ),
	|	АУН_Ставки.Услуга,
	|	АУН_Ставки.ОбъектАренды,
	|	АУН_Ставки.Ставка,
	|	АУН_Ставки.СтавкаНДС,
	|	АУН_Ставки.СпособНачисления,
	|	АУН_Ставки.Площадь
	|ИЗ
	|	РегистрСведений.АУН_Ставки КАК АУН_Ставки
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(АУН_Ставки.Период, ДЕНЬ) > &НачалоПериода
	|	И НАЧАЛОПЕРИОДА(АУН_Ставки.Период, ДЕНЬ) <= &КонецПериода
	|	И АУН_Ставки.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавки.ДатаЗаписи,
	|	ВТСтавки.ДатаЗаписи КАК ДатаНачала,
	|	ВТСтавки.Ставка КАК Ставка,
	|	ВТСтавки.СтавкаНДС,
	|	ВТСтавки.Услуга,
	|	ВТСтавки.ОбъектАренды,
	|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	|	ВТСтавки.Площадь
	|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	|ИЗ
	|	ВТСтавки КАК ВТСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1))) КАК ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ПериодыГрафиков
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	ВТСтавкиДатыНачалаБезПересечения.СтавкаНДС,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ПериодыГрафиков.ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ПериодыГрафиков.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ПериодыГрафиков.ОбъектАренды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	|	&НачалоПериода,
	|	0,
	|	ВТСтавкиДатыНачалаБезПересечения.СтавкаНДС,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ЗНАЧЕНИЕ(Справочник.АУН_СпособыНачисленияАренднойПлаты.ПустаяСсылка),
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1)
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.СтавкаНДС,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.СтавкаНДС,
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаОкончания.ДатаНачала КАК ДатаНачала1,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1))) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	|ИЗ
	|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаОкончания.ДатаНачала,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.СтавкаНДС,
	|	ВТСтавкиДатаНачала.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиПоПериодам.ДатаЗаписи,
	|	ВТСтавкиПоПериодам.Услуга,
	|	ВТСтавкиПоПериодам.ОбъектАренды,
	|	ВТСтавкиПоПериодам.Ставка КАК Ставка,
	|	ВТСтавкиПоПериодам.СтавкаНДС,
	|	ВТСтавкиПоПериодам.СпособНачисления,
	|	ВТСтавкиПоПериодам.Площадь,
	|	ВТСтавкиПоПериодам.ДатаНачала КАК ДатаНачала,
	|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода
	|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	|ИЗ
	|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.СтавкаНДС,
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	|ИЗ
	|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.СтавкаНДС,
	|	ВТСтавкиЧислоДатаНачала.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	ВТГрафикИзмененияСтавок.Площадь КАК Количество,
	|	ВТГрафикИзмененияСтавок.Ставка КАК СтавкаСпособаНачисления,
	|	ВТГрафикИзмененияСтавок.Ставка КАК Цена,
	|	ВТГрафикИзмененияСтавок.СпособНачисления,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|				И СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|			ТОГДА СтатусыОбъектовАренды.ДатаНачалаАренды
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < ВТГрафикИзмененияСтавок.ДатаЗаписи
	|			ТОГДА ВТГрафикИзмененияСтавок.ДатаЗаписи
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаНачала
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|				И СтатусыОбъектовАренды.ДатаОкончанияАренды > ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|			ТОГДА СтатусыОбъектовАренды.ДатаОкончанияАренды
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаОкончания
	|	КОНЕЦ КАК ПериодКонец,
	|	СтатусыОбъектовАренды.ДатаНачалаАренды,
	|	СтатусыОбъектовАренды.ДатаОкончанияАренды,
	|	ВТГрафикИзмененияСтавок.СтавкаНДС КАК СтавкаНДС,
	|	ВТГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	|	СтатусыОбъектовАренды.Договор КАК Договор,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется) КАК ВариантОбеспечения
	|ИЗ
	|	РегистрСведений.АУН_СтатусыОбъектовАренды.СрезПоследних(
	|			&ДатаСреза,
	|			Договор = &Договор
	|				И Услуга.АУН_ПостояннаяЧастьОплаты) КАК СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ВТГрафикИзмененияСтавок
	|		ПО СтатусыОбъектовАренды.Услуга = ВТГрафикИзмененияСтавок.Услуга
	|			И СтатусыОбъектовАренды.ОбъектАренды = ВТГрафикИзмененияСтавок.ОбъектАренды
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= &КонецПериода)
	|			И (ВТГрафикИзмененияСтавок.ДатаОкончания >= СтатусыОбъектовАренды.ДатаНачалаАренды)
	|			И (ВТГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	|ГДЕ
	|	СтатусыОбъектовАренды.Статус = &ВАренде
	|	И СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды,
	|	ВТГрафикИзмененияСтавок.ДатаЗаписи,
	|	ПериодНачало,
	|	ПериодКонец
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область РаботаСКурсамиВалют

// Возвращает курс валюты на дату
//
// Параметры:
//  Валюта     - Валюта (элемент справочника "Валюты")
//  ДатаКурса  - Дата, на которую следует получить курс
//
// Возвращаемое значение: 
//  Структура, содержащая:
//   Курс      - курс валюты
//   Кратность - кратность валюты
//
Функция ПолучитьКурсВалюты(Валюта, ДатаКурса, Договор) Экспорт

	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаКурса);	

КонецФункции

#КонецОбласти

#Область РаботаСПериодом

// Функция возвращает начало периода для заданной периодичности и даты.
Функция НачалоПериода(Дата, Периодичность) Экспорт 
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		Возврат НачалоДня(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат НачалоГода(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Если Месяц(Дата)<7 Тогда
			Возврат НачалоГода(Дата);
		Иначе
			Возврат ДобавитьМесяц(НачалоГода(Дата),6);
		КонецЕсли;
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
	
КонецФункции

// Функция возвращает конец периода для заданной периодичности и даты.
Функция КонецПериода(Дата, Периодичность) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		Возврат КонецДня(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат КонецНедели(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат КонецМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат КонецКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат КонецГода(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Если Месяц(Дата)<7 Тогда
			Возврат ДобавитьМесяц(НачалоГода(Дата), 6) - 1;
		Иначе
			Возврат КонецГода(Дата);
		КонецЕсли;
	Иначе
		Возврат КонецДня(Дата);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура предназначена для расчета суммы начисления по известному периоду начисления и ставке
// Параметры:
//		ДанныеУчета - таблица значений с данными для расчета. В строках таблицы указывается период начисления и ставка
//
Процедура РассчитатьСуммуНачисления(ДанныеУчета) Экспорт
	
	Для Каждого Стр Из ДанныеУчета Цикл
		РассчитатьСтрокуНачисления(Стр);
	КонецЦикла;		
	Кол = ДанныеУчета.Количество();
	Для Сч = 1 по Кол Цикл
		Стр = ДанныеУчета[Кол - Сч];
		Если Стр.КоличествоДней = 0 Тогда
			ДанныеУчета.Удалить(ДанныеУчета.Индекс(Стр));	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для расчета суммы начисления по известному периоду начисления и ставке
// Параметры:
//		Стр - строка таблицы значений с данными для расчета. В строке указывается период начисления и ставка
//
Процедура РассчитатьСтрокуНачисления(СтрокаТаблицы, НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт
	
	Если НачалоПериода = Неопределено Тогда
		НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода)) / 86400 + 1; // Количество дней
	
	ПериодНачисления = СтрокаТаблицы.СпособНачисления.ПериодНачисления;
	Коэффициент = АУН_ОбщиеПроцедуры.ПолучитьКоэффициентПересчетаДней(НачалоПериода, КонецПериода, ПериодНачисления);
	
	Результат = СтрокаТаблицы.СтавкаСпособаНачисления * СтрокаТаблицы.Количество * Коэффициент;
	СтрокаТаблицы.Сумма = Окр(Результат, 2);
	СтрокаТаблицы.Цена = ?(СтрокаТаблицы.Количество = 0,СтрокаТаблицы.Сумма,СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество);
	
КонецПроцедуры

Процедура РассчитатьСуммуЦену(ДанныеОбъекта, ДанныеНачисления, ЭтоПостояннаяЧасть = Ложь)
	
	Для Каждого СтрокаТаб Из ДанныеНачисления Цикл
		РассчитатьСуммуЦенуВСтрокеТаб(ДанныеОбъекта, СтрокаТаб, ЭтоПостояннаяЧасть);	
	КонецЦикла;
	
КонецПроцедуры

// Процедура пересчитывает валютные суммы и рассчитывает цену.
Процедура РассчитатьСуммуЦенуВСтрокеТаб(ДанныеОбъекта, СтрокаТаб, ЭтоПостояннаяЧасть) Экспорт
	
	// Пересчитать вылюты
	Если ЗначениеЗаполнено(СтрокаТаб.Цена) И ЗначениеЗаполнено(ДанныеОбъекта.Валюта) и ЗначениеЗаполнено(СтрокаТаб.Валюта) Тогда
		Если НЕ СтрокаТаб.Валюта = ДанныеОбъекта.Валюта Тогда
			СтруктураКурсаСтроки = ПолучитьКурсВалюты(СтрокаТаб.Валюта, ДанныеОбъекта.Дата, ДанныеОбъекта.Договор);
			СтруктураКурса = ПолучитьКурсВалюты(ДанныеОбъекта.Валюта, ДанныеОбъекта.Дата, ДанныеОбъекта.Договор);
			СтрокаТаб.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаТаб.Сумма,
				СтрокаТаб.Валюта, ДанныеОбъекта.Валюта,
				СтруктураКурсаСтроки.Курс, СтруктураКурса.Курс,
				СтруктураКурсаСтроки.Кратность, СтруктураКурса.Кратность);
		КонецЕсли;															
	КонецЕсли;
	// Рассчитать цену
	Если ЭтоПостояннаяЧасть И ЦенаДолжнаБытьРавнаСтавке(ДанныеОбъекта, СтрокаТаб.СпособНачисления, СтрокаТаб.КоличествоДней) Тогда
		СтрокаТаб.Цена = СтрокаТаб.СтавкаСпособаНачисления;
	Иначе
		СтрокаТаб.Цена = СтрокаТаб.Сумма / ?(СтрокаТаб.Количество = 0, 1, СтрокаТаб.Количество);
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет условия, при котором цена в строке табличной части заказа клиента
// или реализации должна соответствовать ставке способа начисления.
Функция ЦенаДолжнаБытьРавнаСтавке(Объект, СпособНачисления, КоличествоДней) Экспорт
 
 Возврат Объект.НачалоПериода = НачалоПериода(Объект.НачалоПериода, СпособНачисления.ПериодНачисления)
   И КонецДня(Объект.ОкончаниеПериода) = КонецПериода(Объект.ОкончаниеПериода, СпособНачисления.ПериодНачисления)
   И Объект.Валюта = СпособНачисления.Валюта 
   И (Объект.ОкончаниеПериода - Объект.НачалоПериода) / 86400 + 1 = КоличествоДней;
 
КонецФункции

// Процедура устанавливает в документ признак включения НДС в стоимость по данным договора.
Процедура УстановитьПризнакВключенияНДСВСтоимость(ДокументОбъект, ИмяТабличнойЧасти, СообщатьОНесоответствии = Истина) Экспорт
	
	СписокУслуг = Новый СписокЗначений;
	СписокУслуг.ЗагрузитьЗначения(ДокументОбъект[ИмяТабличнойЧасти].Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
	ЕстьУслуги = Ложь;
	Для каждого Элемент Из СписокУслуг Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			ЕстьУслуги = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьУслуги Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатусыОбъектовАренды.Регистратор.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ПОМЕСТИТЬ ВТПризнаки
	|ИЗ
	|	РегистрСведений.АУН_СтатусыОбъектовАренды.СрезПоследних(
	|			&НачалоПериода,
	|			Договор = &Договор
	|				И Услуга В (&СписокУслуг)) КАК СтатусыОбъектовАренды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатусыОбъектовАренды.Регистратор.ЦенаВключаетНДС
	|ИЗ
	|	РегистрСведений.АУН_СтатусыОбъектовАренды.СрезПоследних(
	|			&КонецПериода,
	|			Договор = &Договор
	|				И Услуга В (&СписокУслуг)) КАК СтатусыОбъектовАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПризнаки.ЦенаВключаетНДС
	|ИЗ
	|	ВТПризнаки КАК ВТПризнаки";
	
	Запрос.УстановитьПараметр("НачалоПериода", ДокументОбъект.АУН_НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ДокументОбъект.АУН_ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", ДокументОбъект.Договор);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() > 1 И СообщатьОНесоответствии Тогда
		ТекстСообщения = "При заполнении обнаружены разные признаки включения НДС за период по услугам";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект);
	КонецЕсли;
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ЦенаВключаетНДС = Выборка.ЦенаВключаетНДС;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
